Catalogs/ПрайсЛисты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ПрайсЛисты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантыСортировки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦен1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦен2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦенСравнить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦенУсловие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидСравненияЗначений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьДатуФормирования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРасчетаКурсаВалюты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФормирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьИзмененныеОпцииОтборов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьИзмененныеОпцииОформления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИерархияСодержимого</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИерархияПрайсЛистов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзменятьРазмерПропорционально</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьИндивидуальный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсключитьПустыеВидыЦен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КартинкаВысота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КартинкаШирина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоКолонок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальнаяЦена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинимальнаяЦена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазваниеЦеныПредставлением</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатураБезЦен</Name>
					<Comment>Выводить номенклатуру даже в том случае, если нет установленных цен.</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборСклад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтмечатьНовинки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодЦен</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПечатьПрайсЛиста</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыПечатиПрайсЛиста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеОстатков</Name>
					<Comment>1 - числом, 2 - ассоциативное представление</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстовоеПредставлениеОстатковДостаточно</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстовоеПредставлениеОстатковМало</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстовоеПредставлениеОстатковМного</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВыводитьКонтактнуюИнформацию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПоложениеТекстаОтносительноМеткиНовинка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УказатьКонтактыОтветственного</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УсловнаяЦена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УсловнаяЦенаЗначение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УсловнаяЦенаЗначениеДо</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УсловнаяЦенаУсловие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидСравненияЗначений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормироватьПоНаличию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьЦенуСЕдиницейИзмерения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПредставлениеНоменклатуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизитНоменклатуры</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизитПредставление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПараметрРасшифровки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ширина</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СлужебныйУправлениеВидимостью</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СлужебныйПолеКомпоновкиПуть</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Номенклатура</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВидыЦен</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидЦен</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КатегорииНоменклатуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КатегорияНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КатегорииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЦеновыеГруппы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЦеноваяГруппа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦеновыеГруппы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОтборНоменклатуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидСравнения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
								<v8:TypeSet>cfg:EnumRef</v8:TypeSet>
								<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
								<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяГруппы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>12</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Порядок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Родитель</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ПрайсЛисты/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

#Область МетодыЗаполнений

Процедура ПроверитьОбязательныеПоля()
	Перем ТаблицаПредставлений;
	
	Если УдалитьИндивидуальный
		И НЕ ЗначениеЗаполнено(Автор) Тогда
		
		Автор = Пользователи.АвторизованныйПользователь();
		
	КонецЕсли;
	
	Если ПустаяСтрока(Наименование) Тогда
		
		Наименование = НСтр("ru ='Прайс-лист'");
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Валюта) Тогда
		
		Валюта = Константы.НациональнаяВалюта.Получить();
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(УсловнаяЦенаУсловие) Тогда
		
		УсловнаяЦенаУсловие = Перечисления.ВидСравненияЗначений.Меньше;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ВидЦенУсловие) Тогда
		
		ВидЦенУсловие = Перечисления.ВидСравненияЗначений.Равно;
		
	КонецЕсли;
	
	Если ПредставлениеНоменклатуры.Количество() = 0 Тогда
		
		Справочники.ПрайсЛисты.ДоступныеПоляНоменклатуры(ТаблицаПредставлений);
		ПредставлениеНоменклатуры.Загрузить(ТаблицаПредставлений);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПредставлениеНоменклатуры(ТаблицаИлиМассивПредставленияНоменклатуры)
	
	Если ТипЗнч(ТаблицаИлиМассивПредставленияНоменклатуры) = Тип("ТаблицаЗначений") Тогда
		
		ПредставлениеНоменклатуры.Загрузить(ТаблицаИлиМассивПредставленияНоменклатуры);
		
	ИначеЕсли ТипЗнч(ТаблицаИлиМассивПредставленияНоменклатуры) = Тип("Массив") Тогда
		
		Для каждого Строка Из ТаблицаИлиМассивПредставленияНоменклатуры Цикл // Элементом массива может быть структура
			
			ЗаполнитьЗначенияСвойств(ПредставлениеНоменклатуры.Добавить(), Строка);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьВидыЦен(ТаблицаИлиМассивВидовЦен)
	
	Если ТипЗнч(ТаблицаИлиМассивВидовЦен) = Тип("ТаблицаЗначений") Тогда
		
		ВидыЦен.Загрузить(ТаблицаИлиМассивВидовЦен);
		
	ИначеЕсли ТипЗнч(ТаблицаИлиМассивВидовЦен) = Тип("Массив") Тогда
		
		Для каждого ЭлементМассива Из ТаблицаИлиМассивВидовЦен Цикл
			
			НоваяСтрока = ВидыЦен.Добавить();
			НоваяСтрока.ВидЦен = ЭлементМассива.ВидЦен;
			НоваяСтрока.Использование = ЭлементМассива.Использование;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьОтборыНоменклатуры(КоллекцияЭлементов)
	
	Если ТипЗнч(КоллекцияЭлементов) = Тип("ТаблицаЗначений") Тогда
		
		ОтборНоменклатуры.Загрузить(КоллекцияЭлементов);
		
	ИначеЕсли ТипЗнч(КоллекцияЭлементов) = Тип("ОтборКомпоновкиДанных") Тогда
		
		ПрайсЛистыСлужебный.СКДОтборНоменклатурыВТабличнуюЧасть(КоллекцияЭлементов.Элементы, ОтборНоменклатуры);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьОтборыНоменклатурыСтандартнымЗначением()
	
	НоваяСтрока = ОтборНоменклатуры.Добавить();
	НоваяСтрока.Имя = "Номенклатура.Недействителен";
	НоваяСтрока.Представление = "Номенклатура.Недействителен";
	НоваяСтрока.ВидСравнения = "Равно";
	НоваяСтрока.Значение = Ложь;
	НоваяСтрока.Использование = Истина;
	
	НоваяСтрока = ОтборНоменклатуры.Добавить();
	НоваяСтрока.Имя = "Номенклатура.ИсключитьИзПрайсЛистов";
	НоваяСтрока.Представление = "Номенклатура.ИсключитьИзПрайсЛистов";
	НоваяСтрока.ВидСравнения = "Равно";
	НоваяСтрока.Значение = Ложь;
	НоваяСтрока.Использование = Истина;
	
КонецПроцедуры

Процедура ЗаполнитьОбъектПоСтруктуре(ДанныеЗаполнения)
	
	ДанныеЗаполнения.Свойство("Автор", 						Автор);
	ДанныеЗаполнения.Свойство("Валюта",						Валюта);
	ДанныеЗаполнения.Свойство("ВариантыСортировки",			ВариантыСортировки);
	ДанныеЗаполнения.Свойство("ВыводитьДатуФормирования",	ВыводитьДатуФормирования);
	ДанныеЗаполнения.Свойство("ДатаРасчетаКурсаВалюты",		ДатаРасчетаКурсаВалюты);
	ДанныеЗаполнения.Свойство("ДатаФормирования",			ДатаФормирования);
	ДанныеЗаполнения.Свойство("ИерархияСодержимого",		ИерархияСодержимого);
	ДанныеЗаполнения.Свойство("Индивидуальный",				УдалитьИндивидуальный);
	ДанныеЗаполнения.Свойство("НазваниеЦеныПредставлением",	НазваниеЦеныПредставлением);
	ДанныеЗаполнения.Свойство("НаименованиеПрайсЛиста",		Наименование);
	ДанныеЗаполнения.Свойство("НоменклатураБезЦен", 		НоменклатураБезЦен);
	ДанныеЗаполнения.Свойство("Описание",					Описание);
	ДанныеЗаполнения.Свойство("Организация",				Организация);
	ДанныеЗаполнения.Свойство("ПечатьПрайсЛиста",			ПечатьПрайсЛиста);
	ДанныеЗаполнения.Свойство("ПериодЦен", 					ПериодЦен);
	ДанныеЗаполнения.Свойство("ФормироватьПоНаличию",		ФормироватьПоНаличию);
	
	ДанныеЗаполнения.Свойство("МаксимальнаяЦена", 			МаксимальнаяЦена);
	ДанныеЗаполнения.Свойство("МинимальнаяЦена", 			МинимальнаяЦена);
	
	ДанныеЗаполнения.Свойство("УсловнаяЦена",				УсловнаяЦена);
	ДанныеЗаполнения.Свойство("УсловнаяЦенаУсловие",		УсловнаяЦенаУсловие);
	ДанныеЗаполнения.Свойство("УсловнаяЦенаЗначение",		УсловнаяЦенаЗначение);
	ДанныеЗаполнения.Свойство("УсловнаяЦенаЗначениеДо",		УсловнаяЦенаЗначениеДо);
	
	ДанныеЗаполнения.Свойство("ВидЦенСравнить", 			ВидЦенСравнить);
	ДанныеЗаполнения.Свойство("ВидЦен1",					ВидЦен1);
	ДанныеЗаполнения.Свойство("ВидЦенУсловие",				ВидЦенУсловие);
	ДанныеЗаполнения.Свойство("ВидЦен2", 					ВидЦен2);
	
	ДанныеЗаполнения.Свойство("КоличествоКолонок",			КоличествоКолонок);
	ДанныеЗаполнения.Свойство("КартинкаШирина",				КартинкаШирина);
	ДанныеЗаполнения.Свойство("КартинкаВысота",				КартинкаВысота);
	ДанныеЗаполнения.Свойство("ИзменятьРазмерПропорционально", ИзменятьРазмерПропорционально);
	
	ДанныеЗаполнения.Свойство("ПредставлениеОстатков",		ПредставлениеОстатков);
	ДанныеЗаполнения.Свойство("ТекстовоеПредставлениеОстатковМало", ТекстовоеПредставлениеОстатковМало);
	ДанныеЗаполнения.Свойство("ТекстовоеПредставлениеОстатковДостаточно", ТекстовоеПредставлениеОстатковДостаточно);
	ДанныеЗаполнения.Свойство("ТекстовоеПредставлениеОстатковМного",ТекстовоеПредставлениеОстатковМного);
	ДанныеЗаполнения.Свойство("ОтборОрганизация",			ОтборОрганизация);
	ДанныеЗаполнения.Свойство("ОтборСклад",					ОтборСклад);
	ДанныеЗаполнения.Свойство("УказатьКонтактыОтветственного", УказатьКонтактыОтветственного);
	ДанныеЗаполнения.Свойство("ИсключитьПустыеВидыЦен",		ИсключитьПустыеВидыЦен);
	ДанныеЗаполнения.Свойство("ВыводитьЦенуСЕдиницейИзмерения",		ВыводитьЦенуСЕдиницейИзмерения);
	
	Если ДанныеЗаполнения.Свойство("ПредставлениеНоменклатуры") Тогда
		
		ЗаполнитьПредставлениеНоменклатуры(ДанныеЗаполнения.ПредставлениеНоменклатуры);
		
	КонецЕсли;
	
	Если ДанныеЗаполнения.Свойство("ВидыЦен") Тогда
		
		ЗаполнитьВидыЦен(ДанныеЗаполнения.ВидыЦен);
		
	КонецЕсли;
	
	Если ДанныеЗаполнения.Свойство("ОтборНоменклатуры") Тогда
		
		ЗаполнитьОтборыНоменклатуры(ДанныеЗаполнения.ОтборНоменклатуры);
		
	Иначе
		
		ЗаполнитьОтборыНоменклатурыСтандартнымЗначением();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Перем ТаблицаПредставлений;
	
	ПредставлениеНоменклатуры.Очистить();
	ВидыЦен.Очистить();
	ОтборНоменклатуры.Очистить();
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		ЗаполнитьОбъектПоСтруктуре(ДанныеЗаполнения);
		
	Иначе
		
		ЗаполнитьОтборыНоменклатурыСтандартнымЗначением();
		
	КонецЕсли;
	
	ПроверитьОбязательныеПоля();
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	УдалитьИндивидуальный = Истина;
	Автор = Пользователи.АвторизованныйПользователь();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если УдалитьИндивидуальный
		И НЕ ЗначениеЗаполнено(Автор) Тогда
		
		Автор = Пользователи.АвторизованныйПользователь();
		
	КонецЕсли;
	
	Если Недействителен Тогда
		
		ПрайсЛистыСлужебный.ПроверитьВозможностьУстановкиПризнакаНедействителен(Ссылка, Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
